ING/Practicas/textos.org
#+TITLE: Textos
#+SETUPFILE: ../../template.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/index.css" />
* Texto 1

The ability of tiny computing devices to control complex operations
has transformed the way many tasks are performed, ranging from
scientific research to producing consumer products. Tiny computers on
a chip are used in medical equipment, home appliances, cars and
toys. Workers use handheld computing devices to collect data at a
customer´s site, to generate forms, to control inventory, and to serve
as desktop organizers.

Not only is computing equipment getting smaller, it is getting more
sophisticated. Computers are part of many machines and devices that
once required continual human supervision and control. Today,
computers in security systems result in safer environments, computers
in cars improve energy efficiency, and computers in phones provide
features such as call forwarding, call monitoring, and call
answering.

These smart machines are designed to take over some of the basic tasks
previously performed by people; by so doing, they make life a little
easier and a little more pleasant. Smart cards store vital information
such as health records, driver’s licenses, bank balances, and so
on. Smart phones, cars, and appliances with built-in computers can be
programmed to better meet individual needs. A smart house has built-in
monitoring systems that can turn lights on and off, open and close
windows, operate the oven, and more.

With small computing devices available for performing smart tasks like
cooking dinner, programming the VCR, and controlling the flow of
information in an organization, people are able to spend more time
doing what they often do best – being creative. Computers can help
people work more creatively.

1. Choose the best title for this text
   - Computers are reducing their size
   - Smart devices will help us with the housework
   - _Computers are making life less difficult in many ways_
   - Robots will take over Man

2. How are computers changing lately?
   - They are getting easier to repair
   - They are getting cheaper because of competence
   - _They are becoming smaller and more efficient_
   - They are turning creative

3. Which is the best synonym for "built-in" as it appears in the text?
   - constructed
   - involved
   - _integrated_
   - redecorated

4. Is this statement True, False, Not mentioned or Totally
   disconnected with the information in the text? "Wars will not need
   people as soldiers in the future".
   - True
   - False
   - Not Mentioned
   - _Totally disconnected_

5. According to the text, what does the expression "by so doing" refer
   to?
   - Computers can control inventory
   - Computers can cook.
   - _Computers can work without constant supervision._
   - Computers are part of bigger machines.

6. This is ……… Harry´s bike. I can tell it from ……… broken front
   light.
   - the / a
   - _……… / the_
   - ……… / some
   - a   / the

7. ……… tigers are ……… biggest cats in the world.
   - Some / the
   - ………  / some
   - _………  / the_
   - A    / a

8. I have got ……… spare blank discs. Do you need ………… ?
   - a    / some
   - any  / some
   - some / ones
   - _some / any_

9. After watching ……… TV, they usually go straight to ……… bed.
   - the / a
   - a   / the
   - _……… / ………_
   - the / the

10. ……… People know ……… snow is white.
    - The  / the
    - A    / ………
    - Some / the
    - _………  / ………_

11. Please, pass me ……… salt.
    - a
    - an
    - _the_
    - one

12. Poetry is for ……… young and ……… old; ……… wise and ……… ignorant.
    - a   / a / a / a
    - an  / an / an / an
    - _the / the / the/ the_
    - the / a / the / a

13. ……… most important thing for him is ……… money.
    - _the / the_
    - ……… / -
    - the / ………
    - ……… / the

14. Which one do you like, ……… blue one or ……… orange one?
    - a    / an
    - ………  / ………
    - some / some
    - _the  / the_

15. Edmund Hillary was the first to climb ……… Mount Everest.
    - an
    - the
    - _………_
    - a

16. We invited ……… Simpsons but we didn´t invite ……… Professor
    Smithers.
    - the / the
    - _the / ………_
    - ……… / some
    - a   / the

17. I´ll try to do ……… best for you.
    - some
    - ………
    - _the_
    - a

18. Your tent is almost torn apart but ……… his is totally destroyed.
    - a
    - the
    - an
    - _………_

19. I never believed ……… John´s explanation. ……… policeman´s one
    seemed more logical.
    - the    / a
    - the    / the
    - _………    / the_
    - one of / the

20. This congress on Ancient Egypt can be ……… unique opportunity to
    reveal ……… unknown manuscript.
    - an / an
    - a  / a
    - an / a
    - _a  / an_

