ING/Practicas/textos.html
<!DOCTYPE html>
<html lang="es">
<head>
<!-- 2022-03-26 Sat 14:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Textos</title>
<meta name="author" content="Alberto Robles Gomez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../css/index.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Textos</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3990ac2">Texto 1</a></li>
<li><a href="#orgdf633f5">Texto 2</a></li>
<li><a href="#orgb1e02f9">Texto 3</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org3990ac2" class="outline-2">
<h2 id="org3990ac2">Texto 1</h2>
<div class="outline-text-2" id="text-org3990ac2">
<p>
The ability of tiny computing devices to control complex operations
has transformed the way many tasks are performed, ranging from
scientific research to producing consumer products. Tiny computers on
a chip are used in medical equipment, home appliances, cars and
toys. Workers use handheld computing devices to collect data at a
customer´s site, to generate forms, to control inventory, and to serve
as desktop organizers.
</p>

<p>
Not only is computing equipment getting smaller, it is getting more
sophisticated. Computers are part of many machines and devices that
once required continual human supervision and control. Today,
computers in security systems result in safer environments, computers
in cars improve energy efficiency, and computers in phones provide
features such as call forwarding, call monitoring, and call
answering.
</p>

<p>
These smart machines are designed to take over some of the basic tasks
previously performed by people; by so doing, they make life a little
easier and a little more pleasant. Smart cards store vital information
such as health records, driver’s licenses, bank balances, and so
on. Smart phones, cars, and appliances with built-in computers can be
programmed to better meet individual needs. A smart house has built-in
monitoring systems that can turn lights on and off, open and close
windows, operate the oven, and more.
</p>

<p>
With small computing devices available for performing smart tasks like
cooking dinner, programming the VCR, and controlling the flow of
information in an organization, people are able to spend more time
doing what they often do best – being creative. Computers can help
people work more creatively.
</p>

<ol class="org-ol">
<li>Choose the best title for this text
<ul class="org-ul">
<li>Computers are reducing their size</li>
<li>Smart devices will help us with the housework</li>
<li><span class="underline">Computers are making life less difficult in many ways</span></li>
<li>Robots will take over Man</li>
</ul></li>

<li>How are computers changing lately?
<ul class="org-ul">
<li>They are getting easier to repair</li>
<li>They are getting cheaper because of competence</li>
<li><span class="underline">They are becoming smaller and more efficient</span></li>
<li>They are turning creative</li>
</ul></li>

<li>Which is the best synonym for "built-in" as it appears in the text?
<ul class="org-ul">
<li>constructed</li>
<li>involved</li>
<li><span class="underline">integrated</span></li>
<li>redecorated</li>
</ul></li>

<li>Is this statement True, False, Not mentioned or Totally
disconnected with the information in the text? "Wars will not need
people as soldiers in the future".
<ul class="org-ul">
<li>True</li>
<li>False</li>
<li>Not Mentioned</li>
<li><span class="underline">Totally disconnected</span></li>
</ul></li>

<li>According to the text, what does the expression "by so doing" refer
to?
<ul class="org-ul">
<li>Computers can control inventory</li>
<li>Computers can cook.</li>
<li><span class="underline">Computers can work without constant supervision.</span></li>
<li>Computers are part of bigger machines.</li>
</ul></li>

<li>This is ……… Harry´s bike. I can tell it from ……… broken front
light.
<ul class="org-ul">
<li>the / a</li>
<li><span class="underline">……… / the</span></li>
<li>……… / some</li>
<li>a   / the</li>
</ul></li>

<li>……… tigers are ……… biggest cats in the world.
<ul class="org-ul">
<li>Some / the</li>
<li>………  / some</li>
<li><span class="underline">………  / the</span></li>
<li>A    / a</li>
</ul></li>

<li>I have got ……… spare blank discs. Do you need ………… ?
<ul class="org-ul">
<li>a    / some</li>
<li>any  / some</li>
<li>some / ones</li>
<li><span class="underline">some / any</span></li>
</ul></li>

<li>After watching ……… TV, they usually go straight to ……… bed.
<ul class="org-ul">
<li>the / a</li>
<li>a   / the</li>
<li><span class="underline">……… / ………</span></li>
<li>the / the</li>
</ul></li>

<li>……… People know ……… snow is white.
<ul class="org-ul">
<li>The  / the</li>
<li>A    / ………</li>
<li>Some / the</li>
<li><span class="underline">………  / ………</span></li>
</ul></li>

<li>Please, pass me ……… salt.
<ul class="org-ul">
<li>a</li>
<li>an</li>
<li><span class="underline">the</span></li>
<li>one</li>
</ul></li>

<li>Poetry is for ……… young and ……… old; ……… wise and ……… ignorant.
<ul class="org-ul">
<li>a   / a / a / a</li>
<li>an  / an / an / an</li>
<li><span class="underline">the / the / the/ the</span></li>
<li>the / a / the / a</li>
</ul></li>

<li>……… most important thing for him is ……… money.
<ul class="org-ul">
<li><span class="underline">the / the</span></li>
<li>……… / -</li>
<li>the / ………</li>
<li>……… / the</li>
</ul></li>

<li>Which one do you like, ……… blue one or ……… orange one?
<ul class="org-ul">
<li>a    / an</li>
<li>………  / ………</li>
<li>some / some</li>
<li><span class="underline">the  / the</span></li>
</ul></li>

<li>Edmund Hillary was the first to climb ……… Mount Everest.
<ul class="org-ul">
<li>an</li>
<li>the</li>
<li><span class="underline">………</span></li>
<li>a</li>
</ul></li>

<li>We invited ……… Simpsons but we didn´t invite ……… Professor
Smithers.
<ul class="org-ul">
<li>the / the</li>
<li><span class="underline">the / ………</span></li>
<li>……… / some</li>
<li>a   / the</li>
</ul></li>

<li>I´ll try to do ……… best for you.
<ul class="org-ul">
<li>some</li>
<li>………</li>
<li><span class="underline">the</span></li>
<li>a</li>
</ul></li>

<li>Your tent is almost torn apart but ……… his is totally destroyed.
<ul class="org-ul">
<li>a</li>
<li>the</li>
<li>an</li>
<li><span class="underline">………</span></li>
</ul></li>

<li>I never believed ……… John´s explanation. ……… policeman´s one
seemed more logical.
<ul class="org-ul">
<li>the    / a</li>
<li>the    / the</li>
<li><span class="underline">………    / the</span></li>
<li>one of / the</li>
</ul></li>

<li>This congress on Ancient Egypt can be ……… unique opportunity to
reveal ……… unknown manuscript.
<ul class="org-ul">
<li>an / an</li>
<li>a  / a</li>
<li>an / a</li>
<li><span class="underline">a  / an</span></li>
</ul></li>
</ol>
</div>
</div>
