ING/Practicas/textos.org
* Texto 2

Multimedia systems are known for their educational and entertainment
value, which we call ‘edutainment’. Multimedia combines text with
sound, video, animation, and graphics, which greatly enhances the
interaction between user and machine and can make information more
interesting and appealing to people. Expert systems software enables
computer to ‘think’ like experts. Medical diagnose expert systems, for
example, can help doctors pinpoint a patient’s illness, suggest
further tests, and prescribe appropriate drugs.

Connectivity enables computers and software that might otherwise be
incompatible to communicate and to share resources. Now that computers
are proliferating in many areas and networks are available for people
to access data and communicate with others, personal computers are
becoming interpersonal PCs. They have the potential to significantly
improve the way we relate to each other. Many people today telecommute
that is, use their computers to stay in touch with the office while
they are working at home. With the proper tools, hospital staff can
get diagnosis from a medical expert hundreds or thousands of miles
away. Similarly, the disabled can communicate more effectively with
others using computers.

Distance learning and videoconferencing are concepts made possible
with the use of an electronic classroom or boardroom accessible to
people in remote locations. Vast databases of information are
currently available to users of the internet, all of whom can send
email messages to each other. The information superhighway is designed
to significantly expand this interactive connectivity so that people
all over the world will have free access to all these resources.

People power is critical to ensuring that hardware, software, and
connectivity are effectively integrated in a socially responsible
way. People – computer users and computer professionals –are ones who
will decide which hardware, software and networks endure and how great
and impact they will have on our lives. Ultimately people power must
be exercised to ensure that computers are used not only efficiently
but in a socially responsible way.

1. Choose the best title for this text.
   - The new educational software
   - People must take care with computers
   - Peripherals and hardware solutions
   - _Computers allow lots of new functionalities_

2. Who must watch out for the right application of the process of
   digitalization?
   - Local authorities
   - Computer experts
   - _People in general_
   - Politicians

3. Which is the best synonym for "exercised" as it appears in the
   text?
   - _put into action_
   - done as homework
   - taken physical activity
   - made possible

4. Is this statement True, False, Not mentioned or Totally
   disconnected with the information in the text? "More people will be
   able to shop from home".
   - True
   - False
   - _Not Mentioned_
   - Totally disconnected

5. According to the text, what does the expression "all of whom"
   refer to?
   - Computer experts
   - _Computer users_
   - Computer programs
   - Computer functions

6. Who´s that pretty girl? ……… name is Sophie.
   - My
   - _Her_
   - His
   - She´s

7. My husband isn´t here, ……… is at work.
   - _he_
   - her
   - his
   - him

8. His car looks nice but I prefer ………
   - my
   - me
   - _mine_
   - I´s

9. My wife never listens to my suggestions. She simply ignores ………
   - they
   - _them_
   - my
   - their

10. Don´t leave your sister behind! Wait for ………
    - _her_
    - she
    - hers
    - She´s

11. People like knowing the news. ……… read ……… in the newspapers or watch ……… on TV.
    - He   / them / them
    - They / them / them
    - _They / it   / it_
    - Them / it   / it

12. Who are ……… women over there?
    - this
    - _those_
    - these
    - that

13. I don´t feel well. ……… head hurts and I´ve got ……… fever.
    - the  / ………
    - mine / a
    - me   / any
    - _my   / a_

14. -"Whose car is that ……… ?" -"It´s ……… ."
    - a    / hers
    - _one  / hers_
    - ones / she´s
    - my   / she

15. No, James didn´t shout at Karen; ……… shouted at ……… !
    - she / he
    - her / him
    - her / he
    - _she / him_

16. I always loved fast cars but now I prefer safe ………
    - them
    - _ones_
    - one
    - it

17. No more excuses: ……… want ……… to do ……… at once!
    - me / you / it
    - I  / you / you
    - He / you / them
    - _I  / you / it_

18. (At the door) -"Who is ……… ?" - " ……… , James. Can I come in?"
    - you  / it is I
    - _it   / it is me_
    - this / it is him
    - that / he is me

19. "Who broke this door knob?". "It was ……… : John and Peter"
    - his
    - they
    - _them_
    - these

20. That baby is crying more and more. ……… must need ……… nappies to be changed.
    - he  / her
    - she / his
    - it  / the
    - _it  / its_

