ING/Practicas/textos.html

<div id="outline-container-orgdf633f5" class="outline-2">
<h2 id="orgdf633f5">Texto 2</h2>
<div class="outline-text-2" id="text-orgdf633f5">
<p>
Multimedia systems are known for their educational and entertainment
value, which we call ‘edutainment’. Multimedia combines text with
sound, video, animation, and graphics, which greatly enhances the
interaction between user and machine and can make information more
interesting and appealing to people. Expert systems software enables
computer to ‘think’ like experts. Medical diagnose expert systems, for
example, can help doctors pinpoint a patient’s illness, suggest
further tests, and prescribe appropriate drugs.
</p>

<p>
Connectivity enables computers and software that might otherwise be
incompatible to communicate and to share resources. Now that computers
are proliferating in many areas and networks are available for people
to access data and communicate with others, personal computers are
becoming interpersonal PCs. They have the potential to significantly
improve the way we relate to each other. Many people today telecommute
that is, use their computers to stay in touch with the office while
they are working at home. With the proper tools, hospital staff can
get diagnosis from a medical expert hundreds or thousands of miles
away. Similarly, the disabled can communicate more effectively with
others using computers.
</p>

<p>
Distance learning and videoconferencing are concepts made possible
with the use of an electronic classroom or boardroom accessible to
people in remote locations. Vast databases of information are
currently available to users of the internet, all of whom can send
email messages to each other. The information superhighway is designed
to significantly expand this interactive connectivity so that people
all over the world will have free access to all these resources.
</p>

<p>
People power is critical to ensuring that hardware, software, and
connectivity are effectively integrated in a socially responsible
way. People – computer users and computer professionals –are ones who
will decide which hardware, software and networks endure and how great
and impact they will have on our lives. Ultimately people power must
be exercised to ensure that computers are used not only efficiently
but in a socially responsible way.
</p>

<ol class="org-ol">
<li>Choose the best title for this text.
<ul class="org-ul">
<li>The new educational software</li>
<li>People must take care with computers</li>
<li>Peripherals and hardware solutions</li>
<li><span class="underline">Computers allow lots of new functionalities</span></li>
</ul></li>

<li>Who must watch out for the right application of the process of
digitalization?
<ul class="org-ul">
<li>Local authorities</li>
<li>Computer experts</li>
<li><span class="underline">People in general</span></li>
<li>Politicians</li>
</ul></li>

<li>Which is the best synonym for "exercised" as it appears in the
text?
<ul class="org-ul">
<li><span class="underline">put into action</span></li>
<li>done as homework</li>
<li>taken physical activity</li>
<li>made possible</li>
</ul></li>

<li>Is this statement True, False, Not mentioned or Totally
disconnected with the information in the text? "More people will be
able to shop from home".
<ul class="org-ul">
<li>True</li>
<li>False</li>
<li><span class="underline">Not Mentioned</span></li>
<li>Totally disconnected</li>
</ul></li>

<li>According to the text, what does the expression "all of whom"
refer to?
<ul class="org-ul">
<li>Computer experts</li>
<li><span class="underline">Computer users</span></li>
<li>Computer programs</li>
<li>Computer functions</li>
</ul></li>

<li>Who´s that pretty girl? ……… name is Sophie.
<ul class="org-ul">
<li>My</li>
<li><span class="underline">Her</span></li>
<li>His</li>
<li>She´s</li>
</ul></li>

<li>My husband isn´t here, ……… is at work.
<ul class="org-ul">
<li><span class="underline">he</span></li>
<li>her</li>
<li>his</li>
<li>him</li>
</ul></li>

<li>His car looks nice but I prefer ………
<ul class="org-ul">
<li>my</li>
<li>me</li>
<li><span class="underline">mine</span></li>
<li>I´s</li>
</ul></li>

<li>My wife never listens to my suggestions. She simply ignores ………
<ul class="org-ul">
<li>they</li>
<li><span class="underline">them</span></li>
<li>my</li>
<li>their</li>
</ul></li>

<li>Don´t leave your sister behind! Wait for ………
<ul class="org-ul">
<li><span class="underline">her</span></li>
<li>she</li>
<li>hers</li>
<li>She´s</li>
</ul></li>

<li>People like knowing the news. ……… read ……… in the newspapers or watch ……… on TV.
<ul class="org-ul">
<li>He   / them / them</li>
<li>They / them / them</li>
<li><span class="underline">They / it   / it</span></li>
<li>Them / it   / it</li>
</ul></li>

<li>Who are ……… women over there?
<ul class="org-ul">
<li>this</li>
<li><span class="underline">those</span></li>
<li>these</li>
<li>that</li>
</ul></li>

<li>I don´t feel well. ……… head hurts and I´ve got ……… fever.
<ul class="org-ul">
<li>the  / ………</li>
<li>mine / a</li>
<li>me   / any</li>
<li><span class="underline">my   / a</span></li>
</ul></li>

<li>-"Whose car is that ……… ?" -"It´s ……… ."
<ul class="org-ul">
<li>a    / hers</li>
<li><span class="underline">one  / hers</span></li>
<li>ones / she´s</li>
<li>my   / she</li>
</ul></li>

<li>No, James didn´t shout at Karen; ……… shouted at ……… !
<ul class="org-ul">
<li>she / he</li>
<li>her / him</li>
<li>her / he</li>
<li><span class="underline">she / him</span></li>
</ul></li>

<li>I always loved fast cars but now I prefer safe ………
<ul class="org-ul">
<li>them</li>
<li><span class="underline">ones</span></li>
<li>one</li>
<li>it</li>
</ul></li>

<li>No more excuses: ……… want ……… to do ……… at once!
<ul class="org-ul">
<li>me / you / it</li>
<li>I  / you / you</li>
<li>He / you / them</li>
<li><span class="underline">I  / you / it</span></li>
</ul></li>

<li>(At the door) -"Who is ……… ?" - " ……… , James. Can I come in?"
<ul class="org-ul">
<li>you  / it is I</li>
<li><span class="underline">it   / it is me</span></li>
<li>this / it is him</li>
<li>that / he is me</li>
</ul></li>

<li>"Who broke this door knob?". "It was ……… : John and Peter"
<ul class="org-ul">
<li>his</li>
<li>they</li>
<li><span class="underline">them</span></li>
<li>these</li>
</ul></li>

<li>That baby is crying more and more. ……… must need ……… nappies to be changed.
<ul class="org-ul">
<li>he  / her</li>
<li>she / his</li>
<li>it  / the</li>
<li><span class="underline">it  / its</span></li>
</ul></li>
</ol>
</div>
</div>
