ING/Practicas/textos.org
* Texto 3
According to new research, learning a second language can slow
cognitive ageing, that is, the speed at which the mental activity of
the brain diminishes. This seems to happen not only in young learners
but also in those who have learnt a new language in their
adulthood. Previous studies had already shown that becoming
functionally bilingual could delay the apparition of elderly demetia
by several years, but the aim of Dr Thomas Bak´s studies was to answer
the question of whether people improve their brain function through
learning new languages , or whether people with better brain functions
are more likely to become bilingual.

Dr Bak´s team assessed data from 835 native English speakers. These
people had passed an intelligence test in 1947 when they were just 11
years old, and were given a new test in their early 70s. Of the
participants, nearly one third said that they could communicate in at
least another language apart from English. Of those, one out of three
admitted they had learnt the new language/s when they were adults.

Researchers said that participants who spoke two or more languages
showed better cognitive abilities than the results from the first
long-ago tests had anticipated. Nevermind if people had been young or
adult language learners. Dr Bak said that the improvements could not
be attributed to the participants´ original intelligence levels and
added: "These findings are relevant as millions of people around
the world acquire a second language later in life. The results show
that being able to use different languages, even when you have started
later in your life, is beneficial against brain ageing.

1. Which is the best title for this text?
   - Better late than never
   - _Learning languages can improve your mental abilities_
   - A curious neurological experiment
   - Intelligence Quotient tests under debate

2. Which word is the best substitute for “aim” in the text?
   - controversy
   - _objective_
   - consequence
   - explanation

3. Who or what does "they" stand for ?
   - the researchers
   - the bilingual people who were interviewed
   - the older people
   - _the people in the experiment_

4. ¿Which of these statements is TRUE according to the text?:
   - Some of the tests results had been manipulates
   - Learning languages is something that can only be done as a child
   - Two groups of people were interviewed: children and elderly
   - _Some people had improved their capacities more than expected_

5. Which is the best synonym for "nevermind" in the text?
   - Very often
   - As always
   - _It doesn´t matter if_
   - However

6. John ́s and Mary ́s jobs are ……… as the best
   - so honourable
   - more honourable
   - _as honourable_
   - less honourable

7. My sister is ……… dancer that I have ever seen
   - the worse
   - _the worst_
   - the goodest
   - the baddest

8. I don ́t like this pub. I prefer them ……… and ………
   - less crowded and eleganter
   - more crowded and more noisy
   - _less crowded and more elegant_
   - crowdeder and noisier

9. They say that La Coruña is very far away from here but Barcelona is ………
   - farer
   - more far
   - _further_
   - fartherer

10. ”Get this one! It's ……… and not ………
    - more cheap     / so old
    - _cheaper        / as old_
    - more expensive / less good
    - expensive      / more good

11. Karen is ……… Susan. She hasn´t left school yet!
    - older than
    - _younger than_
    - the youngest
    - the oldest

12. I´ve got enough work to do this weekend. Don´t give me any ………
    - much
    - _more_
    - less
    - most

13. Cádiz is quite far from Madrid. On the contrary, Córdoba is ………
    - the furthest
    - further
    - as far
    - _not so far_

14. Playing an instrument is just practice. The ……… you play, the ……… it gets.
    - more   / more easy
    - easier / more
    - most   / easiest
    - _more   / easier_

15. Use all your strength! The ……… , the ………
    - more hard / the more good
    - hardest   / best
    - _harder    / better_
    - most hard / most good

16. Is this all you can do with this Ferrari? Can´t you drive it any ……… ?
    - fastest
    - the fastest
    - _faster_
    - less fast

17. Do you really think John is good-looking? Paul is obviously ……… than him
    - more good-looking
    - _better-looking_
    - the best-looking
    - the least good-looking

18. Pau is ……… in his family while Marc is ………
    - the more intelligent / the less
    - the intelligenter    / the less
    - _the most intelligent / the least_
    - the intelligentest   / the least

19. The door couldn´t be opened. So he had to push ……… until it slammed open
    - harder and hardest
    - more and more hard
    - _harder and harder_
    - the most and most

20. The hotel is almost empty. There are ……… visitors than we expected at Christmas
    - _less_
    - fewer
    - more
    - minus
