ING/Practicas/textos.html

<div id="outline-container-orgb1e02f9" class="outline-2">
<h2 id="orgb1e02f9">Texto 3</h2>
<div class="outline-text-2" id="text-orgb1e02f9">
<p>
According to new research, learning a second language can slow
cognitive ageing, that is, the speed at which the mental activity of
the brain diminishes. This seems to happen not only in young learners
but also in those who have learnt a new language in their
adulthood. Previous studies had already shown that becoming
functionally bilingual could delay the apparition of elderly demetia
by several years, but the aim of Dr Thomas Bak´s studies was to answer
the question of whether people improve their brain function through
learning new languages , or whether people with better brain functions
are more likely to become bilingual.
</p>

<p>
Dr Bak´s team assessed data from 835 native English speakers. These
people had passed an intelligence test in 1947 when they were just 11
years old, and were given a new test in their early 70s. Of the
participants, nearly one third said that they could communicate in at
least another language apart from English. Of those, one out of three
admitted they had learnt the new language/s when they were adults.
</p>

<p>
Researchers said that participants who spoke two or more languages
showed better cognitive abilities than the results from the first
long-ago tests had anticipated. Nevermind if people had been young or
adult language learners. Dr Bak said that the improvements could not
be attributed to the participants´ original intelligence levels and
added: "These findings are relevant as millions of people around
the world acquire a second language later in life. The results show
that being able to use different languages, even when you have started
later in your life, is beneficial against brain ageing.
</p>

<ol class="org-ol">
<li>Which is the best title for this text?
<ul class="org-ul">
<li>Better late than never</li>
<li><span class="underline">Learning languages can improve your mental abilities</span></li>
<li>A curious neurological experiment</li>
<li>Intelligence Quotient tests under debate</li>
</ul></li>

<li>Which word is the best substitute for “aim” in the text?
<ul class="org-ul">
<li>controversy</li>
<li><span class="underline">objective</span></li>
<li>consequence</li>
<li>explanation</li>
</ul></li>

<li>Who or what does "they" stand for ?
<ul class="org-ul">
<li>the researchers</li>
<li>the bilingual people who were interviewed</li>
<li>the older people</li>
<li><span class="underline">the people in the experiment</span></li>
</ul></li>

<li>¿Which of these statements is TRUE according to the text?:
<ul class="org-ul">
<li>Some of the tests results had been manipulates</li>
<li>Learning languages is something that can only be done as a child</li>
<li>Two groups of people were interviewed: children and elderly</li>
<li><span class="underline">Some people had improved their capacities more than expected</span></li>
</ul></li>

<li>Which is the best synonym for "nevermind" in the text?
<ul class="org-ul">
<li>Very often</li>
<li>As always</li>
<li><span class="underline">It doesn´t matter if</span></li>
<li>However</li>
</ul></li>

<li>John ́s and Mary ́s jobs are ……… as the best
<ul class="org-ul">
<li>so honourable</li>
<li>more honourable</li>
<li><span class="underline">as honourable</span></li>
<li>less honourable</li>
</ul></li>

<li>My sister is ……… dancer that I have ever seen
<ul class="org-ul">
<li>the worse</li>
<li><span class="underline">the worst</span></li>
<li>the goodest</li>
<li>the baddest</li>
</ul></li>

<li>I don ́t like this pub. I prefer them ……… and ………
<ul class="org-ul">
<li>less crowded and eleganter</li>
<li>more crowded and more noisy</li>
<li><span class="underline">less crowded and more elegant</span></li>
<li>crowdeder and noisier</li>
</ul></li>

<li>They say that La Coruña is very far away from here but Barcelona is ………
<ul class="org-ul">
<li>farer</li>
<li>more far</li>
<li><span class="underline">further</span></li>
<li>fartherer</li>
</ul></li>

<li>”Get this one! It's ……… and not ………
<ul class="org-ul">
<li>more cheap     / so old</li>
<li><span class="underline">cheaper        / as old</span></li>
<li>more expensive / less good</li>
<li>expensive      / more good</li>
</ul></li>

<li>Karen is ……… Susan. She hasn´t left school yet!
<ul class="org-ul">
<li>older than</li>
<li><span class="underline">younger than</span></li>
<li>the youngest</li>
<li>the oldest</li>
</ul></li>

<li>I´ve got enough work to do this weekend. Don´t give me any ………
<ul class="org-ul">
<li>much</li>
<li><span class="underline">more</span></li>
<li>less</li>
<li>most</li>
</ul></li>

<li>Cádiz is quite far from Madrid. On the contrary, Córdoba is ………
<ul class="org-ul">
<li>the furthest</li>
<li>further</li>
<li>as far</li>
<li><span class="underline">not so far</span></li>
</ul></li>

<li>Playing an instrument is just practice. The ……… you play, the ……… it gets.
<ul class="org-ul">
<li>more   / more easy</li>
<li>easier / more</li>
<li>most   / easiest</li>
<li><span class="underline">more   / easier</span></li>
</ul></li>

<li>Use all your strength! The ……… , the ………
<ul class="org-ul">
<li>more hard / the more good</li>
<li>hardest   / best</li>
<li><span class="underline">harder    / better</span></li>
<li>most hard / most good</li>
</ul></li>

<li>Is this all you can do with this Ferrari? Can´t you drive it any ……… ?
<ul class="org-ul">
<li>fastest</li>
<li>the fastest</li>
<li><span class="underline">faster</span></li>
<li>less fast</li>
</ul></li>

<li>Do you really think John is good-looking? Paul is obviously ……… than him
<ul class="org-ul">
<li>more good-looking</li>
<li><span class="underline">better-looking</span></li>
<li>the best-looking</li>
<li>the least good-looking</li>
</ul></li>

<li>Pau is ……… in his family while Marc is ………
<ul class="org-ul">
<li>the more intelligent / the less</li>
<li>the intelligenter    / the less</li>
<li><span class="underline">the most intelligent / the least</span></li>
<li>the intelligentest   / the least</li>
</ul></li>

<li>The door couldn´t be opened. So he had to push ……… until it slammed open
<ul class="org-ul">
<li>harder and hardest</li>
<li>more and more hard</li>
<li><span class="underline">harder and harder</span></li>
<li>the most and most</li>
</ul></li>

<li>The hotel is almost empty. There are ……… visitors than we expected at Christmas
<ul class="org-ul">
<li><span class="underline">less</span></li>
<li>fewer</li>
<li>more</li>
<li>minus</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alberto Robles Gomez</p>
<p class="date">Created: 2022-03-26 Sat 14:52</p>
</div>
</body>
</html>
